{
  "backend/main.mo": "Motoko canister handling user profiles, inquiries, and products with access control and admin-restricted operations.",
  "feature_evidence.json": "Feature evidence report listing frontend files, components, and tests related to loading backend data and newsletter submissions.",
  "frontend-file-summaries.txt": "JSON-style mapping that summarizes the roles of major frontend components, hooks, pages, and configuration files.",
  "frontend/index.css": "Tailwind base layer defining OKLCH theme variables for light and dark modes and applying global styles.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "App entry with hash-based routing rendering the landing page, product detail page, or not-found page.",
  "frontend/src/components/landing/BenefitsSection.tsx": "Static benefits section displaying three product advantages with icons and decorative imagery.",
  "frontend/src/components/landing/ContactSection.tsx": "Contact form that submits inquiries to the backend with loading, success, and error states.",
  "frontend/src/components/landing/FeaturedProductsSection.tsx": "Featured products grid fetching products from backend, showing skeletons, empty state, and navigation to product pages.",
  "frontend/src/components/landing/HeroSection.tsx": "Displays a hero banner with background image, headline, and button that scrolls to the products section.",
  "frontend/src/components/landing/SiteFooter.tsx": "Renders the site footer with brand info, quick links, social icons, and smooth-scroll navigation.",
  "frontend/src/components/landing/SubscribeSection.tsx": "Provides a newsletter subscription form with validation, mutation handling, and success/error states.",
  "frontend/src/components/landing/TestimonialsSection.tsx": "Fetches and displays customer testimonials with loading skeletons and fallback initials-based avatars.",
  "frontend/src/data/products.ts": "Defines product types and utilities for slug generation, product lookup, and backend-to-frontend mapping.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context providing login, logout, and identity persistence using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for products, testimonials, inquiries, and newsletter subscriptions using the actor.",
  "frontend/src/index.css": "Configures Tailwind layers and CSS variables for theme colors, typography, and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/NotFoundPage.tsx": "Shows a styled 404 page with message and button to navigate back home.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays a product detail view by fetching all products, mapping them, and showing image and descriptions with loading skeletons and a back button.",
  "frontend/src/router/useHashRoute.ts": "Implements simple hash-based routing with parsing for home, product, and not-found routes, plus navigation helpers.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL query parameters, persisting them in sessionStorage, and removing them from hashes.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugin usage for the frontend.",
  "project_state.json": "Contains project metadata, feature list, and requirements tracking for the beauty products website."
}